# oh-my-zsh
# Подгрузим содержимое https://github.com/ohmyzsh/ohmyzsh/tree/master/lib
ohmyzsh/ohmyzsh path:lib

# Добавим какие-нибудь плагины
ohmyzsh/ohmyzsh path:plugins/colored-man-pages
ohmyzsh/ohmyzsh path:plugins/colorize
ohmyzsh/ohmyzsh path:plugins/command-not-found
ohmyzsh/ohmyzsh path:plugins/common-aliases
ohmyzsh/ohmyzsh path:plugins/zsh-syntax-highlighting

# мне еще нравится этот
# он позволяет добавить к текущей или предыдущей команде sudo, два раза нажав <ESC> 
ohmyzsh/ohmyzsh path:plugins/sudo

# этот плагин вставляет закрывающую кавычку или скобку при вводе открывающей...
hlissner/zsh-autopair

# уведомляет о том, что у команды есть алиас
MichaelAquilina/zsh-you-should-use

# подстановка ранее введеных команд
zsh-users/zsh-autosuggestions kind:defer

# автодополнение аргументов
zsh-users/zsh-completions kind:defer

# я обещал превратить терминал в раскраску...
# подсветка синтаксиса zsh (раскрашивание ключевых слов и прочих разделителей разными цветами)
zdharma-continuum/fast-syntax-highlighting kind:defer

# ну и поставим какую-нибудь тему
ohmyzsh/ohmyzsh path:themes/romkatv/powerlevel10k.zsh-theme